Tekla.Structures.ModelInternal.ICDelegate.ExportCreateBentPlateByParts(System.Int32,System.Int32)


Tekla.Structures.ModelInternal.ICDelegate.ExportCreateBentPlateByFaces(System.Int32,System.Int32,Tekla.Structures.ModelInternal.dotPolygon_t@,Tekla.Structures.ModelInternal.dotPolygon_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportConnectGeometryTrees(Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportConnectGeometryTreesByPoints(Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.Internal.dotPoint_t@,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportModifyCylindricalSurfaceNode(System.Int32,Tekla.Structures.ModelInternal.dotContour_t@,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportGetBentPlateMaximumRadius(System.Int32,Tekla.Structures.ModelInternal.dotClientId_t@)


Tekla.Structures.ModelInternal.ICDelegate.ExportSelectBentPlate(Tekla.Structures.ModelInternal.dotPart_t@)
DO NOT USE! For internal usage only!
pPart: The bent plate to select
Returns: 0 in the case of failure, 1 in the case of success

Tekla.Structures.ModelInternal.ICDelegate.ExportModifyBentPlate(Tekla.Structures.ModelInternal.dotPart_t@)
DO NOT USE! For internal usage only!
pPart: The bent plate to modify
Returns: 0 in the case of failure, 1 in the case of success

Tekla.Structures.ModelInternal.ICDelegate.ExportAddToPourUnit(Tekla.Structures.ModelInternal.dotPourObject_t@,Tekla.Structures.ModelInternal.dotClientId_t@)
DO NOT USE! For internal usage only!
inputPour:
clientId:
Returns:

Tekla.Structures.ModelInternal.ICDelegate.ExportSingleRebarGetRebarSet(System.Int32)
